▶ 7조 팀원 역할분담

  🧑‍💻 김준현 — 개발자
     • 기능 구현 
        - order
        - payment
     • 백오피스 기능 시연영상 녹화본
     • 기능 테스트

  🧑‍💻 김혜린 — 파트리더(팀리더)
     • 기능 구현: 
        - store
        - review
        - product
     • Git README.md 파일
     • 프로젝트 결과물 정리본
     • 기능 테스트

  🧑‍💻 박주원 — 아키텍트 리더
     • 기능 구현: 
        - user
        - address
        - category
        - gateway
     • Git 레포지토리 관리
     • 애플리케이션 배포 
     • CI/CD 구축
     • 기능 테스트

  🧑‍💻 한수빈 — 개발자
     • 기능 구현: 
        - notice
        - complain
        - report
     • 팀 프로젝트 발표
     • 기능 테스트


▶ 서비스 구성 및 실행방법
     • 서비스 구성
        - user: 회원가입, 회원수정, 회원탈퇴, 로그인, 로그아웃, 회원조회
        - store: 가게 등록/수정/삭제/조회
        - review: 리뷰 작성/수정/삭제/조회
        - report: 후기 신고 작성/삭제/조회
        - product: 상품 등록/수정/삭제/조회
        - order: 주문 등록/수정/취소/조회
        - payments: 결제 등록/취소/조회
        - address: 배송지 등록/조회/수정/삭제
        - category: 카테고리 추가/수정/삭제/조회
        - notice: 공지사항 등록/수정/삭제/조회
        - complain: 고객신고 접수/삭제/조회


     • 실행방법
      <고객>
        - 회원가입
        - 로그인
        - 상품 검색
        - 상품 조회
        - 주문 등록/취소
        - 결제 
        - 리뷰 등록/수정/삭제/조회
        - 문의 등록/수정/삭제/조회
        - 공지사항 조회

      <가게>
        - 회원가입
        - 로그인
        - 가게 등록
        - 메뉴 등록
        - 주문 처리
        - 리뷰 조회/신고
        - 문의 등록/수정/삭제/조회
        - 공지 사항 조회

      <관리자>
        - 회원가입
        - 로그인
        - 공지 사항 등록/수정/삭제/조회
        - 문의 등록/수정/삭제/조회
        - 카테고리 등록/수정/삭제/조회
        - 가게 등록/수정/삭제/조회
        - 메뉴 등록/수정/삭제/조회
        - 리뷰 등록/수정/삭제/조회
        - 주문 등록/수정/삭제/조회
        - 결제 등록/수정/삭제/조회





▶ 프로젝트 목적/상세

  ⛳ 목적
     • 백엔드 기술자로서의 자질 키우기: 기획자, 웹디자이너,프론트 엔지니어의 기능/비기능 요구사항을 구체화 할 수 있다.
     • 팀 협업 능력 성장: 백엔드 개발 팀의 일원으로 팀원과 협업을 통해 통합된 어플리케이션을 개발할 수 있다.

  📄 상세
     • 광화문 근처에서 운영될 음식점들의 배달 및 포장 주문 관리, 결제, 그리고 주문 내역 관리 기능을 제공하는 주문 관리 플랫폼으로
       고객, 음식점, 관리자가 사용 가능한 통합 API 웹 서비스 시스템  
     • 운영 지역 초기에는 광화문 근처로 한정하여 운영하며, 향후 확장을 고려한 지역 분류 시스템 설계할 예정
        → 향후 확장성 가능: 지역별 필터링, 지역정보 수정 및 추가 등이 가능 하도록 고려

     • 프로젝트 구조
        - Monolithic Application
        - Layered Architecture: Controller, Service, Repository 계층으로 구성
        - Entity 및 DTO: 각 기능별로 Entity와 DTO(Data Transfer Object)를 분리하여 관리
        - API 설계: RESTful API 원칙에 따라 설계
        - Exception Handling: 글로벌 예외 처리 (ExceptionHandler 사용)

     • 데이터베이스 설계
        - 테이블 명명 규칙: 모든 테이블에 p_ 접두사 사용
        - UUID 사용: 모든 주요 엔티티의 식별자는 UUID를 사용
        - Audit 필드: 모든 테이블에 created_at, created_by, updated_at, updated_by, deleted_at, deleted_by 필드를 추가하여 데이터 감사 로그 기록
        - ERD 설계: 엔티티 간의 관계를 명확히 하는 ERD(Entity-Relationship Diagram) 작성

     • 보안
        - JWT 인증: Spring Security와 JWT(Json Web Token)를 이용한 인증 및 권한 관리
        - 권한 확인 : CUSTOMER 이상의 권한은 요청마다 저장되어 있는 권한 값과 동일한지 체크필요
        - 비밀번호 암호화: BCrypt 해시 알고리즘을 사용한 비밀번호 암호화
        - 데이터 유효성 검사: 서버 측 데이터 유효성 검사를 위해 Spring Validator 사용

     • 세부 API
        - 음식점 분류
          ▪ 카테고리: 다음과 같은 음식점 카테고리로 분류
             예) 한식, 중식, 분식 
          ▪ 향후 확장성: 음식점 카테고리를 추가하거나 수정할 수 있도록 유연한 데이터 구조 설계

        - 결제 시스템
          ▪ 결제 방식: 카드 결제만 가능
          ▪ PG사 연동: PG사와의 결제 연동은 외주 개발로 진행하며, 결제 관련 내역만 플랫폼의 데이터베이스에 저장
          ▪ 결제 테이블: 결제 내역을 저장하기 위한 전용 테이블 설계

        - 주문 관리
          ▪ 주문 취소: 주문 생성 후 5분 이내에만 취소 가능하도록 제한
          ▪ 주문 유형: 온라인 주문과 대면 주문(가게에서 직접 주문) 모두 지원
          ▪ 대면 주문 처리: 가게 사장님이 직접 대면 주문을 접수

        - 데이터 보존 및 삭제 처리
          ▪ 데이터 보존: 모든 데이터는 완전 삭제되지 않고 숨김 처리로 관리
          ▪ 상품 숨김: 개별 상품도 숨김 처리 가능하도록 구현(숨김과 삭제는 다른 필드에서 동작해야함)
          ▪ 데이터 감사 로그: 모든 정보에 생성일, 생성 아이디, 수정일, 수정 아이디, 삭제일, 삭제 아이디를 포함

        - 접근 권한 관리
          ▪ 고객: 자신의 주문 내역만 조회 가능
          ▪ 가게 주인: 자신의 가게 주문 내역, 가게 정보, 주문 처리 및 메뉴 수정 가능
          ▪ 관리자: 모든 가게 및 주문에 대한 전체 권한 보유
        
        - 배송지 정보
          ▪ 필수 입력 사항: 주소지, ////요청 사항
          ▪ ‘주문’ 과 ‘배달’ 에 모두 관련된 정보


▶ ERD
 URL주소 ➡️ https://zigzag-oxygen-e26.notion.site/7-1-2-0634d1288070463e9f952d30285105e7?pvs=4


▶ 기술 스택
     • 백엔드: Spring Boot 3.3
     • 데이터베이스: PostgreSQL
     • 빌드 툴: Gradle
     • 버전 관리: Git을 이용한 버전 관리(GitHub)
     • CI/CD: GitHub Action 
     • 배포: AWS 
